blog/2021/03/19/problem-solving/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>读书: Problem Solving with Algorithms and Data Structures - 你对这个世界要有点意见</title>
  <meta charset="utf-8" />
  <meta name="author" content="lijigang" />
  <meta name="description" content="什么是Computer Science" />


  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">你对这个世界要有点意见</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/">Blog</a></li>
          <li><a href="https://github.com/lijigang">GitHub</a></li>
          <li><a href="http://www.zhihu.com/people/lijigang.com">知乎</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row post-content">
        <div class="col-md-2"></div>
            <h1>读书: Problem Solving with Algorithms and Data Structures</h1>
            
<div id="outline-container-org08de750" class="outline-2">
<h2 id="org08de750">What is CS?</h2>
<div class="outline-text-2" id="text-org08de750">
<p>
Computer Science 就是一门专门研究 Problems 与 Problem-solving 的学科.
</p>

<p>
面对一个 问题, 一个 Computer Sciencist 的目标就是找出一个 算法 (即解决方案), 明确指示出如何一步步地解决该问题.
</p>

<p>
当然, 这里还会涉及到 可计算性 的问题(P与NP), 面对不可计算的问题, 设计什么 样的算法来满足解决问题的目标, 也是一个CS的研究内容.
</p>

<p>
一个计算机科学家在解决问题的过程中, 要多次进行抽象:
</p>

<p>
首先是对 待解决的问题 进行一次抽象
现实世界里的问题一般都会包含比较多的条件, 把现实世界里的问题明确表示的过程中, 不可避免地要进行一次抽象, 去掉无关的边缘条件, 保留该问题最核心的内容.
</p>

<p>
其实是对 解决方案 的抽象
我们开车的时候, 踩一脚油门车就动了, 我们不需要去了解车是怎么打火的, 发动机是 怎么运作的. 这种对解决方案的包装, 展示给最终用户的界面, CS里叫Interface, 现 在互联网圈叫用户体验.
</p>
</div>
</div>

<div id="outline-container-orgd199073" class="outline-2">
<h2 id="orgd199073">What is Programming?</h2>
<div class="outline-text-2" id="text-orgd199073">
<p>
编程 就是把 算法 (问题的解决方案) 用某一种编程语言给表述出来的过程.
</p>

<p>
也就是说, 编程的第一步是 你已有某一问题的解决方案在手 , 没有 算法 就没有 程序.
</p>

<p>
CS不是研究如何编程的学科, 但编程, 却是一个Computer Scientist工作中的一个重要 组成. 毕竟, CS目标是 解决问题 , 编程是把这个 问题的解决方案 给最终实现的 基础操作, 重要性可想而知.
</p>

<p>
综合以上两部分, 总结一下计算机科学家的工作主要是:
</p>

<p>
把一个现实问题抽象, 用 Data 来表示
针对该问题, 设计出相应的解决方案 算法
把该 算法 用编程语言给表述出来 程序
计算机运行该 程序 , 从而解决现实问题
</p>
</div>
</div>

<div id="outline-container-org1b9a28d" class="outline-2">
<h2 id="org1b9a28d">Programming Languages</h2>
<div class="outline-text-2" id="text-org1b9a28d">
<p>
编程语言提供了 Data Structure 和 Control Structure.
</p>
</div>


<div id="outline-container-org35cc73c" class="outline-3">
<h3 id="org35cc73c">Data Structure</h3>
<div class="outline-text-3" id="text-org35cc73c">
<p>
计算机只认识 0 和 1.
</p>

<p>
相信每个CS都听过上面这句, 所有Data对应到计算机执行指令的时候都是0和1, 但各个 编程语言会对这些01串进行「包装」, 这样我们在使用这些语言的时候, 就可以从包装 后的「砖块」层级来考虑如何把算法用该语言表述出来, 而不需要以01串的角度来思考.
</p>

<p>
各编程语言本身自带的这些对01串的「包装」叫做 Primitive Data Types. 可以理 解为天赋属性. 语言好坏, 很多时候从这里就可以做一个区分了.
</p>

<p>
对于复杂的现实世界问题, 所有编程语言都不可能出厂时都「包装」好「砖块」让你砌 墙. 所以后来才会有了 Abstract Data Type 的概念. 通过支持自定义类, 你可以自 己去「包装」现实世界, 抽象数据类型出来, 想怎么玩就怎么玩.
</p>
</div>
</div>


<div id="outline-container-org8472e4c" class="outline-3">
<h3 id="org8472e4c">Control Structure</h3>
<div class="outline-text-3" id="text-org8472e4c">
<p>
有了数据结构, 我们可以表示现实世界中的问题了. 但仍需要更重要的一个东西来把我 们的 算法 表述出来. 表述算法的语句就是 Control Structure.
</p>

<p>
语句控制可以大概分为三类:
</p>

<ol class="org-ol">
<li>Sequential Processing (顺序执行)</li>
<li>Selection (选择分支执行)</li>
<li>Iteration (重复执行)</li>
</ol>

<p>
只要有了这三类语句控制, 我们就可以表述算法了. 剩下的工作就是把 算法 给翻译 成 这些语句的工作了, 也就是 编程.
</p>
</div>
</div>
</div>

    </div>
</section>




<footer id="footer">
    <br />
    <script>
        var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "https://hm.baidu.com/hm.js?36d44a2295ffa55a3ab51c6aa7a71733";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();
    </script>
</footer>

  </body>
</html>
